---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.GetMatchOptions
source: html/18e6e337-9e0e-3c4f-b021-59003c5b4883.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.GetMatchOptions Method

Gets the match options used to filter external resources.

## Syntax (C#)
```csharp
public ExternalResourceMatchOptions GetMatchOptions()
```

## Returns
The external resource match options.